src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаЭлементаПроДокторов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
		
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипВнешнейСистемы				 = Перечисления.ТипыВнешнихСистем.ПроДокторов;
		Объект.КлючПриложения					 = Строка(Новый УникальныйИдентификатор);
		СформироватьНаименование(); 
		Элементы.ГруппаУдалить.Видимость 		 = Ложь; 
		
	КонецЕсли;
	
	УидСессии = ЛичныйКабинет.УидТекущейСессии();
	
	ПолучитьАдресАпиДляОтправкиЗапросов(); 
	ЗаполнитьСоответствиеСтруктурныхЕдиниц();
	
КонецПроцедуры

&НаСервере
// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Справочники.ВнешниеСистемы.ПодключитьВнешнююСистему(РеквизитФормыВЗначение("Объект"), Ложь, УИДСессии);
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
	СтруктураОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	Оповестить("ЗаписанаВнешняяСистема", СтруктураОповещения);  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, копирует адрес сервера в буфер обмена.
//
Процедура КопироватьАдресСервера(Команда)
	
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ЭтотОбъект.АдресAPI);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура, копирует ключ приложения в буфер обмена.
//
Процедура КопироватьКлючПриложения(Команда)
	
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(Объект.КлючПриложения);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'"));  
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
	
	ПоказатьВопрос(
	Оповещение,
	"Вы точнохотите пометить на удаление данный элемент справочника?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, 
	КодВозвратаДиалога.Да
	);    
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();
	
	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет параметры внешней системы.
//
Процедура ЗаполнитьПараметрыВнешнейСистемы(ТекущийОбъект)
	
	МассивСтруктурныхЕдиниц = Новый Массив();
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СоответствиеСтруктурныхЕдиниц Цикл     
		
		СтруктураСЕ = Новый Структура();
		СтруктураСЕ.Вставить("СтруктурнаяЕдиница", СтрокаТЧ.СтруктурнаяЕдиница);
		СтруктураСЕ.Вставить("Использовать"		 , СтрокаТЧ.Использовать);
		
		МассивСтруктурныхЕдиниц.Добавить(СтруктураСЕ); 		
		
	КонецЦикла;	
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура;
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы.Свойство("МассивСтруктурныхЕдиниц") Тогда
		ПараметрыВнешнейСистемы.МассивСтруктурныхЕдиниц = МассивСтруктурныхЕдиниц;
	Иначе
		ПараметрыВнешнейСистемы.Вставить("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	КонецЕсли;
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ВнешняяСистема"	 , Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		
		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
	ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
	ВнешняяСистемаОбъект.Используется    = Ложь;
	
	Попытка
		ВнешняяСистемаОбъект.Записать();
	Исключение 
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Процедура, получает адрес для отправки запросов.
//
Процедура ПолучитьАдресАпиДляОтправкиЗапросов()
	
	ЭтоОблако = ПараметрыСеанса.ОбластьДанныхИспользование;
	Если ЭтоОблако = Истина Тогда
		АдресПубликации = "https://cloud.stoma1c.ru/app/" + Формат(ПараметрыСеанса.ОбластьДанныхЗначение, "ЧГ=");
	Иначе
		АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(АдресПубликации) Тогда
		ЭтотОбъект.АдресAPI = АдресПубликации + "/hs/api/v1";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеСтруктурныхЕдиниц()

	МассивСтруктурныеЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	Для каждого Элемент Из МассивСтруктурныеЕдиниц Цикл
		СтрокаТЧ = ЭтотОбъект.СоответствиеСтруктурныхЕдиниц.Добавить();
		СтрокаТЧ.СтруктурнаяЕдиница = Элемент;
		СтрокаТЧ.clinic_id 			= Строка(Элемент.УникальныйИдентификатор()); 
	КонецЦикла;

	МассивПроверреныхСЕ = Новый Массив;
	ТекущаяСЕ           = Неопределено;
	ИндексГруппы        = -1;
	ИндексТЧ            = 0;
	
	ЭтотОбъект.СоответствиеСтруктурныхЕдиниц.Сортировать("СтруктурнаяЕдиница");
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СоответствиеСтруктурныхЕдиниц Цикл
		
		Если ТекущаяСЕ <> СтрокаТЧ.СтруктурнаяЕдиница ИЛИ ТекущаяСЕ = Неопределено Тогда
			
			ТекущаяСЕ = СтрокаТЧ.СтруктурнаяЕдиница;
			
			Если Не ЗначениеЗаполнено(ТекущаяСЕ) ИЛИ МассивПроверреныхСЕ.Найти(ТекущаяСЕ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивПроверреныхСЕ.Добавить(ТекущаяСЕ);
			
			ИндексГруппы = ИндексГруппы + 1;
			ДобавитьСтруктурнуюЕдиницуНаФорму(ИндексГруппы, ИндексТЧ, Истина);	
			
			ИндексТЧ = ИндексТЧ + 1;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет структурную единицу на форму.
//
Процедура ДобавитьСтруктурнуюЕдиницуНаФорму(Индекс, ИндексСЕ, ПервичноеЗаполнение = Ложь)
	
	// Общая группа = ГруппаОбщаяДляСтруктурныхЕдиниц!!!
	ГруппаСтрокаСтруктурнойЕдиницы = КопироватьГруппуФормы(Элементы.ГруппаСтрокаСтруктурнойЕдиницы_ДляКопирпования, Индекс, Элементы.ГруппаОбщаяДляСтруктурныхЕдиниц);
	
	ПутьКДаннымСЕ 			  = "СоответствиеСтруктурныхЕдиниц[" + ИндексСЕ + "].СтруктурнаяЕдиница";
	ЭлементСтруктурнаяЕдиница = КопироватьЭлементФормы(Элементы.СтруктурнаяЕдиница_ДляКопирования, Индекс, ГруппаСтрокаСтруктурнойЕдиницы, ПутьКДаннымСЕ);
	
	ПутьКДаннымИдентификатора = "СоответствиеСтруктурныхЕдиниц[" + ИндексСЕ + "].clinic_id";
	ЭлементИдентификатор 	  = КопироватьЭлементФормы(Элементы.Идентификатор_ДляКопирования, Индекс, ГруппаСтрокаСтруктурнойЕдиницы, ПутьКДаннымИдентификатора);
	
	ДекорацияКопироватьUID 	  = КопироватьЭлементФормы(Элементы.ДекорацияСкопироватьСтрокуСЕ_ДляКопирования, Индекс, ГруппаСтрокаСтруктурнойЕдиницы);
	
	Если Не ПервичноеЗаполнение Тогда  		
 
		// Для вебклиента странным образом работает ТекущийЭлемент приводит к ошибке, 248972.
		Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() = Ложь Тогда
			ЭтаФорма.ТекущийЭлемент = ЭлементСтруктурнаяЕдиница;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет эквайринговый терминал на форму.
//
Процедура ДобавитьЭквайринговыйТерминалНаФорму(ИндексГруппы, ИндексТЧ, ПервичноеЗаполнение = Ложь)
	
	// Заполняем группу списка ЭТ
	ГруппаСписокЭТ = Элементы["ГруппаСписокЭквайринговыхТерминалов_" + Число(ИндексГруппы)];
	ГруппаЭТиО     = КопироватьГруппуФормы(Элементы.ГруппаЭквайринговыйТерминалОрганизация_ДляКопирования, ИндексТЧ, ГруппаСписокЭТ);
	
	// Заполняем группу ЭТ и О
	ПутьКДаннымЭТ            = "СтруктурноЭквайринговыеСоответствия[" + ИндексТЧ + "].ЭквайринговыйТерминал";	
	ЭлементЭТ                = КопироватьЭлементФормы(Элементы.ЭквайринговыйТерминал_ДляКопирования    , ИндексТЧ, ГруппаЭТиО, ПутьКДаннымЭТ);	
	ДекорацияОрганизация     = КопироватьЭлементФормы(Элементы.ДекорацияОрганизация_ДляКопирования     , ИндексТЧ, ГруппаЭТиО);
	ДекорацияУдалитьСтрокуЭТ = КопироватьЭлементФормы(Элементы.ДекорацияУдалитьСтрокуЭТ_ДляКопипрования, ИндексТЧ, ГруппаЭТиО);	
	
	Если Не ПервичноеЗаполнение Тогда
		
		СтруктурнаяЕдиница = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексГруппы)].СтруктурнаяЕдиница;
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексТЧ)].СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		
		КлючСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексГруппы)].КлючСтроки;
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексТЧ)].КлючСтроки = КлючСтроки;
		
		// Для вебклиента странным образом работает ТекущийЭлемент приводит к ошибке, 248972.
		Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() = Ложь Тогда
			ЭтаФорма.ТекущийЭлемент = ЭлементЭТ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
// Функция,  возвращает результат создания группы формы.
//
Функция КопироватьГруппуФормы(ГруппаИсточник, ПрефиксИмениНовойГруппы, Родитель)
	Возврат УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, ГруппаИсточник, ПрефиксИмениНовойГруппы, Родитель);	
КонецФункции

&НаСервере
// Функция, возвращает результат создания кнопки формы.
//
Функция КопироватьКнопкуФормы(КнопкаИсточник, ПрефиксИмениНовойКнопки, Родитель)
	Возврат УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, КнопкаИсточник, ПрефиксИмениНовойКнопки, Родитель);
КонецФункции

&НаСервере
// Функция, возвращает результат создания элемента формы.
//
Функция КопироватьЭлементФормы(ЭлементИсточник, ПрефиксИмениНовогоЭлемента, Родитель, ПутьКДанным = Неопределено)
	Возврат УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, ЭлементИсточник, ПрефиксИмениНовогоЭлемента,, Родитель, ПутьКДанным);	
КонецФункции

&НаКлиенте
// Функция, возвращает индекс элемента по его наименованию.
//
Функция ПолучитьИндексНаименования(НаименованиеЭлемента)

	НачалоИндекса = СтрНайти(НаименованиеЭлемента, "_", НаправлениеПоиска.СКонца);
	Возврат Сред(НаименованиеЭлемента, НачалоИндекса + 1);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

&НаКлиенте
Процедура ДекорацияСкопироватьСтрокуСЕНажатие(Элемент)

	Индекс = Число(ПолучитьИндексНаименования(Элемент.Имя));
	Если ЭтотОбъект.СоответствиеСтруктурныхЕдиниц.Количество() >= Индекс + 1 Тогда
		
		ИдентификаторСЕ = ЭтотОбъект.СоответствиеСтруктурныхЕдиниц[Индекс].clinic_id;

		ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ИдентификаторСЕ);	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'")); 
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
